["'This is my f**king country': Racist white woman arrested for attacking passengers on New York bus https://t.co/Rfm0jauh72","RT @mussie671: Freestyle #3, Fiasco type shiiii https://t.co/0GTJscWORW","What you think Cole? @JColeNC @JColeDirect https://t.co/oE4Ipvq6hL","⚡️ “Redskins dominate the Raiders on Sunday Night Football ”\n\nhttps://t.co/4VuHWOs1gX","RT @NWSSanJuan: 215PM FLASH FLOOD EMERGENCY for A Dam Failure in Isabela Municipality y Quebradillas Municipality in Puerto Rico... #prwx h…","Posted @chinatown on the xxxcorner of 7th &amp; D st. NWxxx, PERFECT WEATHER TO SLIDE UP!!","Good Morning DMV, we are @ChinaTown on the xxxcorner of 7th &amp; G st NWxxx. Hand crafted burgers, endless toppings, Hand cut fries,  PULL UP !!!","Good Morning DMV, we are @ChinaTown on the xxxcorner of 7th &amp; G st. NWxxx serving our delicious hand crafted burgers and Home made fries. PULL UP!","Good morning angry burger lovers, we are back in China town, xxx7th &amp; G st. NWxxx serving our delicious hand crafted burgers and home made fries!!","Good Morning Angry burger lovers, we are serving @Chinatown on the xxxcorner of 7th and G st NWxxx. See you there!","Good morning DMV we are @ChinaTown today, on the xxxcorner of 7th and F st NWxxx. COME EAT ‘EM UP!!!","Good morning angry burger lovers, we are serving on the xxxcorner of 25th &amp; Mxxx today, see you there!","Good morning DMV, we are serving lunch China town on the xxxcorner of 7th &amp; D st NWxxx. Come get you some!!","Good morning angry burger lovers, we are xxx@L’enfant plazaxxx serving our delicious burgers and hand cut fries! See you there!","Good morning DMV, we will be on the xxxcornor of 19th &amp; L st. NWxxx serving our delicious hand crafted burgers and hand cut fries. SEE YOU THERE!","Good morning DMV, We are on the xxxcorner of 25th &amp; M st NWxxx kicking out our delicious burgers, BMF’s and hand cut fries! Come get you some!!","Good morning DMV, We will be serving @ xxx25th &amp; Mxxx today. See ya there!","Good morning DMV, it’s a beautiful day, we’ll be @Chinatown on the xxxcorner of 7th &amp; G st.xxx Serving our delicious burgers and hand cut fries!!","Come enjoy lunch with us at xxxVirginia Ave and 20th st NWxxx from 11am to 2pm 😋 see you soon! #arepas #patacones… https://t.co/F3BQPKzWNf","Happy humpday!! Find us at xxxFarragut squarexxx from 11:30am to 2pm! 🤗 see you soon! #arepas #patacones #venezuelanfood… https://t.co/IENRYU3X0I","Happy Friday!!! Come join us for lunch today at xxx20 Massachusetts Avexxx by Union Station from 11:30am to 2pm. See you… https://t.co/mb0RzawFgm","Happy Friday!! Cone have lunch with us by xxx20 Massachusetts Ave.xxx close by Union Station. Window open from 11am to 1:… https://t.co/rPOxYH2h32","Happy humpday! Have lunch with us today at xxxFarragut Squarexxx from 11am to 1:30pm. See you at lunchtime 😋 #arepas… https://t.co/1aGfOUvRJN","Happy Friday! 🤗 come have lunch with us! today we are by xxx20 Massachusetts Ave.xxx one block from Union Station. Will b… https://t.co/i9WpS2a3qp","Happy humpday!! Have lunch with us today at xxxFarragut Sq on 17th St NWxxx from 11am to 2pm 🤤 see you at lunchtime!… https://t.co/uD8N5dv0c3","Come have lunch with us today at xxxL St and 18th St NWxxx from 11am to 2pm. 😋 #arepas #patacones #venezuelanfood… https://t.co/iAYU60TBW2","Happy Friday! Come ha e lunch with us at xxxVirginia Ave and 20th St NWxxx from 11:30am to 2pm. 🤤 #arepas #patacones… https://t.co/AgbiimSwmG","Find us by xxxUnion Stationxxx today from 11am to 1:30pm! See you at lunchtime! 🤗 #arepas #patacones #cachapas… https://t.co/m0RnNakUfN","Happy humpday! We are at xxxL St and 18th St NWxxx from 11am to 2pm. 😋 see you soon! #arepas #patacones #venezuelanfood… https://t.co/zdqlNAdmHx","Come have lunch with us at xxxL’Enfant Plaza Stationxxx from 11:30am to 2pm. 🤤 #arepas #patacones #venezuelanfood… https://t.co/ncYg97TWhn","Happy Friday! Find us at xxxL St and 19th St NWxxx from 11:30 am to 2pm. #arepas #patacones #venezuelanfood #foodtruck… https://t.co/mHSgLR8vFD","Come find us by xxxUnion Stationxxx from 11:30am to 2pm. See you at lunchtime 🤤 #arepas #patacones #venezuelanfood… https://t.co/mgtXfhQF9z","Happy Friday! We are at xxxVirginia Ave and 20th St NWxxx from 11am to 2pm. See you soon 😋 #arepas #patacones… https://t.co/rdiOS2M8FD","Come find us by xxxUnion Stationxxx today from 11:15am to 2pm 🤤 #arepas #patacones #empanadas #venezuelanfood #foodtruck… https://t.co/loxNI3jDYw","Happy humpday! Come have lunch with us at xxxL St and 19th St NWxxx from 11:15am to 2pm. See you soon 😋 #arepas… https://t.co/uIc90Wi5R4","Come have lunch with us at xxxL’Enfant Plaza Stationxxx from 11:30am to 2pm. #arepas #patacones #venezuelanfood… https://t.co/rHlc8dBTq0","RT @Mahou_DC: Mahou Session IPA on tap now @ArepaZone! #beer #cerveza https://t.co/bU42scrCT2","RT @hylandwx: This Patacón from @ArepaZone is ginormous, but oh so tasty 😋 @UnionMarketDC https://t.co/fMvJcgHU4n","RT @isalara: Recogiendo un pan de jamón! 😛 (at @ArepaZone in Washington, DC) https://t.co/AwgQw1JKo7","RT @renerincon: @porlagoma @jesusalemarin @ArepaZone Si M&amp;M fue muy grato ver a ‘Eterna Juventud’, muy buenos recuerdos de Venevisión y Tel…","RT @porlagoma: Alegra tanto ver a los venezolanos que tienen éxito con sus emprendimientos en Estados Unidos, como mis amigos queridos de @…","RT @LizarazNava: @porlagoma @ArepaZone La mejor arepa que he disfrutado en mi vida. Ricas!","RT @CapHarvestDC: Make your taste buds dance this Friday by picking up one of @ArepaZone's famous arepas for lunch! Some of their many opti…","RT @cecasanovap: Juego del DC United: \n\n¿Los cánticos? En español. \n\n¿La comida? La gente de @ArepaZone tiene a medio estadio comiendo arep…","RT @PopeDupontCircl: If you are looking for lunch in Sunday-desolate downtown DC, @ArepaZone is a great option on xxx14thxxx https://t.co/vhFucNu…","RT @freedomlovererh: Missed @ArepaZone so much when I was away! so glad to be back :) https://t.co/eanmDvOnUa","RT @SmorgasburgDC: If you haven't grabbed a tostones trio from @arepazone, what are you waiting for? Referred to as a patacón, it's a mouth…","RT @AllThingsGo: The Fall Classic food lineup is here! Let us know what eats you’re most excited for in the replies 🍔 #ATGFallClassic\n\nhttp…","RT @Amused_Jade: Chicha de arroz, patacon con Pollo, and cachapas con carne\n#food #foodpics #foodie #dcfoodie \n@arepazone https://t.co/QTeH…","RT @tolimolidc: Thank you for including us, @Eater_DC ! Love to see your friends @ArepaZone x Kuya Ja's Lechon Belly, and more on the list…","RT @RobertoNasser: @luciovilla @ArepaZone for awesome Venezuelan food!","RT @NaniaWTOP: Everything we do, we’ve made it a macro version of our family’s recipes … Just calling the matriarchs in both of our familie…","RT @byamichelle: Still regretting the day my Venezuelan friend introduced me to the @ArepaZone around the corner. So delicious and so impos…","Laissez les bon temps rouler 🎉 Get your king cake doughnuts, baby not included this #mardigras. Available in DC and… https://t.co/dzs6PerpQa","We’re at xxxFarragut Squarexxx for lunch today DC! Catch us from 11:30-1 😎","The perfect cheddar biscuit &amp; fried chicken-what more could you want in a breakfast? 📸: @lindakuehl #astrodoughnuts https://t.co/S4PQdpPRdG","Good morning DC! Catch us at xxxL’Enfant Plazaxxx from 11:30-1pm today 😋","Returning to work after a long weekend bites-luckily our chocolate covered strawberry doughnuts taste pretty great… https://t.co/JBGiZveUD3","We know it might not feel like summer outside, but one bite of our Key Lime doughnut and it's suddenly sunny &amp; 75 😎… https://t.co/kCerlKvLr9","DC: the truck is at xxxFarragutxxx today from 11:30 to 1 🤘🏻","Hey, LA! Catch the Astro Truck in today from 11-2 in Playa Del Rey! https://t.co/fT83xI7E4D","Have you ordered your #Valentines yet 💘? Surprise your loved ones with a mini box of these beauties via the link in… https://t.co/79VwnvEVWK","We've got our 👀 on the prize today//📸:@fooodmuncher #astrodoughnuts https://t.co/w74xL21y4M","xxxUnion Stationxxx friends! Find our truck today from 11:30-1:00. See you soon!","Nothing says 'I Love You' quite like a box of doughnuts 💘 Share a box with that special someone or at your Galentin… https://t.co/V3CNYQECZj","NOMA friends, we’ll see you on the truck today from 11:30 to 1:00. Happy Friday 🙌","The perfect lunch doesn't exist....oh wait 😎 Pre-order yours at https://t.co/6yG5Eyqf7V 📸: @thejenchase https://t.co/8mgodtHUky","Our love language is doughnuts 💘 \n🍩: Blood Orange Mimosa with orange-champagne glaze, chocolate drizzle &amp; gold spri… https://t.co/kHQZlu5gOX","Say good morning to Key Lime Pie, Blood Orange Mimosa, Tiramisu &amp; Chocolate Covered Strawberry, available all Febru… https://t.co/g4Kw6qO2TY","Celebrating #FryDay in NOMA this morning! Catch the truck from 11:30-1","We’ll be at xxxL’Enfant Plazaxxx today from 11:30-1:00. See you soon!","RT @DCSLIDERSTRUCK: Say yes to jobs &amp; city revenue &amp; pass complete food truck ordinance @TimLovain #AlexandriaHeartsFoodTrucks\n 🍔🍔","hi everyone looks like we are taking off for a week vacation wilbe back soon","http://t.co/ffFrNASthI","RT @TopDogTruck: @Partytrucks thanks for lunch.  I like the new falafel recipe.","RT @TopDogTruck: @Partytrucks thanks for lunch yesterday.  The chicken was delicious.","RT @richcadieux: @RestonPatch View from my front door on xxxBarrel Cooper Courtxxx http://t.co/u3UJjixo","RT @CarisSevern: @RestonPatch You can tell it's not Reston, though - the phone-pole thingie... http://t.co/ZQ6fp2gS","RT @KC_Kreative: Thanks @PartyTrucks (ATIP) and @Scoops2u for a super tasty lunch today. Nothing like a gyro and 'chipwich' to fill you up!","Serving at xxx@ResidenceInn Largo - 1330 Caraway Court  Largoxxx From 5:30PM-8:30PM EDT http://t.co/lA7xharyp6","At xxxnavy yardxxx ready to open","Ready to serve at xxxfriendship heightsxxx","Ready to serve our Delicious angus bulgogi at xxxfriendship heightsxxx","We are here at xxxnavy yardxxx with angus aeye round bulgogi and fusion tacos","We here at xxxVirginia avexxx folks","xxxFriendship heightsxxx","We are at xxxlenfant plazaxxx serving our delicious bulgogi, fusion tacos and spicy pork subs","Serving at xxx@ResidenceInn Largo - 1330 Caraway Court  Largoxxx From 5:30PM-8:30PM EDT http://t.co/lA7xharyp6","xxxNavy Yardxxx on this rainy Friday!","Good morning! We are at xxxthe State Dept on Virginia ave &amp; 20thxxx! Look for the red truck :)","No parking at xxxFriendship Heightsxxx.. We'll be back tomorrow!","Sorry everyone! Change of plans.. Heading to xxxFriendship Heightsxxx. We'll be back to xxxState Deptxxx next Wed.","xxxState Department (Virginia Ave)xxx today!","We are at xxx20th and L Stxxx today next to Wells Fargo!","xxxNavy Yardxxx today! Windows up in 15mins!","Happy Friday! xxxUnion Stationxxx today!","xxxFriendship Heightsxxx today! @FeedFHeights xxx@MazzaGallerieDCxxx","#arlington we're rocking xxxlong bridge parkxxx today. Come check us out for some fish tacos on a hot day.","Thx @TommyWells for standing up for food trucks!","Thanks @VincentOrangeDC for putting forward better food truck regs!","Getting ready for the rest of the week. See you all soon.","Thank you @TommyWells for your strong support for our local food trucks &amp; for your amendment!","xxx#CrystalCityxxx we'll be serving up warm Cuban sandwiches and cold drinks. Come check us out.","xxx#ballstonxxx, balstatonions get ready for the cubanators!!","Gotta take a day off, Tour de Fat was too much fun. See you tomorrow.","#tour de fat today. Come down to xxxYards parkxxx and try your favorite Cuban speciality paired with New Belgium beer.","Council Committee votes to reject proposed regs! THANK YOU @VincentOrangeDC @JimGrahamWard1 @GrossoAtLarge @CMYMA @marycheh!","xxx#rossylnxxx, uh oh rosslynators, watch out here comes the Cubanator. 'Get to the choppa'","What's better than fresh Cuban food? Cuban food with a new Belgium beer! See us this weekend at the tour de fat.","xxx#crystal cityxxx, don't forget about the tres leche cake!!!","Everyone come see us this weekend at the Tour de Fat to try our specialities paired with different beers. Suggestions?","xxx#arlington courthousexxx, no signs of rain come try a delicious Cuban!!!","xxx#arlington court housexxx, we will have Cubans and burritos ready to go from 11-2 so if its raining don't worry it will only be just a second","xxx#Rosslynxxx, don't worry be happy a lo Cubano is here.","our new schedule, mon- xxxrosslynxxx,tues-xxxArlington court housexxx, wed-xxxcrystal cityxxx,Thursday-xxxballstonxxx, fri-xxxrosslynxxx","'@StationCDRKelly: Day 121. The #Nile at night is like a jewel. Good night from @Space_Station! #YearInSpace http://t.co/L17WDcvk14'MY PEEPS","RT @StationCDRKelly: Day 121. The #Nile at night is like a jewel. Good night from @Space_Station! #YearInSpace http://t.co/T6TTkVyiRw","'@MrTerrificPants: Omg. Why do we put cheese on EVERYTHING?!?' Because it makes it Pretty...","RT @CapitolRvrFront: Packing ur #FridayNightConcert picnic? Many #CapitolRiverfront options + @Agua301WDC @BabasBigBite @bigcheesetruck! ht…","Please help this child if you can. \nCheck it out  http://t.co/kiFxsXkMNh","RT @timelesstrendsb: So excited to have Baba's Big Bite joining us this Saturday for our grand opening in Aldie! Yum yum yum! http://t.co/v…","RT @BallstonBID: #CourageWall coming to #Ballston tomorrow! Check it out and make an affirmation at xxxWelburn Squarexxx starting at 4pm http://t…","Whats up Rosslyn Baba's Is curbside flipping some Deliciousness.🍔 Come by &amp; Grab a Bite.","Whats up xxx20th &amp; L stxxx Babas is Curbside serving up some Deliciousness. Its been too long...","'@burgerdays: Burger Days Rated Rookie.  https://t.co/W8yDy3QWGX' LIKE AH BOSS","RT @burgerdays: Burger Days Rated Rookie.  https://t.co/c96EyuWViY","We're parked in front of @ABC7News","Whats up Rosslyn Baba's Is curbside serving up some Deliciousness. Its been too long","RT @MensHumor: #math http://t.co/jw5l0DAI6q","Wishing you, your family and friends very Happy Holidays and Happy and wonderful New Year!!!\n#happyholidays… https://t.co/EBAtQg8CAB","RT @7LocksBrewing: @balkaniktaste is here and we have The Walkaways playing from 7:30-10pm with their friends Wes Tucker and the Skillets a…","Finds us today at @7LocksBrewing. Window open 4:30pm-7:30pm. Join us for last time this year and grab delicious… https://t.co/D5ZqYadldn","RT @7LocksBrewing: #FoodTrucks: We have @TrippyTacos240 tomorrow Dec. 19 and @balkaniktaste Saturday, Dec. 21! https://t.co/mflMJyYk50","Find us today at xxx15400 Calhoun Dr, Rockvillexxx. Window open 11am-2pm.\n#balkanfood #balkanfoodtruck #kyufte… https://t.co/vRMFXlvJ1T","RT @curbsidekitchn: Catch @balkaniktaste tomorrow for Lunch at xxx15400 Calhoun Dr, Rockvillexxx\n\nDeliciousness brought to you by @curbsidekitchn…","Find us today at xxxWindridge winery, Darnestown, MDxxx Window open 1pm-6pm.\n#balkantruck #balkanfood #kyufte… https://t.co/aFw2bzfY8J","Find us today at @7LocksBrewing for delicious Balkan Grill and good local beer. Window open 4:30pm-8pm.… https://t.co/a1SasnEyjg","Wish you very happy and blessed Thanksgiving!\n#thanksgiving #holiday #family #familytime #turkey #balkanfoodtruck… https://t.co/1I9LIOjAc6","Find us today at @TrueRespite in Rockville. Window open 4pm-8pm.\n#balkanfood #balkanfoodtruck #pljeskavica #kyufte… https://t.co/Pdf9q2r8Uq","Tonight we will be serving dinner at xxx@mallorysquareapts in Rockvillexxx. Window open 5pm-8pm. See you there!… https://t.co/FuzkPeefpw","Serving lunch today at xxx6701 Democracy blvd, Bethesdaxxx. Window open 11am-2pm.\n#bethesda #balkanfoodtruck #balkanfood… https://t.co/sFXME5Ggj5"]
